{
  "data": {
    "header": {
      "fullname": "Diego Castillo",
      "position": "Software Developer",
      "description": "Senior Developer with over 5 years of experience building high-traffic applications for the Finance, Automotive, and E-commerce sectors. Expert in React, React Native, and NestJS, with a proven track record of managing platforms for 3M+ users. I focus on creating scalable, data-driven user experiences while integrating modern Agentic Architecture to solve complex system design challenges. Skilled in using OpenSpec to structure how AI agents interact with internal services, ensuring reliable communication between frontend interfaces and autonomous backends.",
      "socialNetworks": [
        {
          "text": "diegocastillogz25@gmail.com",
          "href": "mailto:diegocastillogz25@gmail.com",
          "image": "email",
          "alt": "email address"
        },
        {
          "text": "github.com/diegocastillogz",
          "href": "https://github.com/diegocastillogz",
          "image": "github",
          "alt": "github profile"
        },
        {
          "text": "linkedin.com/in/diegocastillogz",
          "href": "https://linkedin.com/in/diegocastillogz",
          "image": "linkedin",
          "alt": "linkedin profile"
        }
      ]
    },
    "experience": [
      {
        "position": "fullstack developer",
        "company": "universidad distrital francisco josé de caldas",
        "url": "https://www.udistrital.edu.co",
        "date": "Oct 2016 - Dec 2017",
        "description": [
          "Developed a web-based platform automating wage calculations for university teachers, integrating qualifications and research data. Streamlined process documentation for stakeholder comprehension. Successfully executed app implementation, integrating flow structures and updating research data."
        ],
        "techstack": "Go, Angular"
      },
      {
        "position": "frontend Developer",
        "company": "Klym",
        "url": "https://klym.com/co/",
        "date": "Feb 2018 - Feb 2019",
        "description": [
          "I improved our factoring web apps by fixing how we process invoices and building a smoother system for money transfers. I also worked closely with the call center team to add features based on their feedback, which made talking to clients much easier. These changes made our daily work more accurate and helped the whole operation run faster."
        ],
        "techstack": "React, Angular"
      },
      {
        "position": "fullstack developer",
        "company": "Bravo Crédito",
        "url": "https://bravocredito.co",
        "date": "Feb 2019 - Jul 2021",
        "description": [
          "I managed the development of a Peer-to-Peer (P2P) lending site, focusing on verifying client data for loan requests. I integrated the platform with government databases to automate credit score checks, which helped the system set fair interest rates for each user. To make things more transparent, I built a dashboard that shows clear credit data to customers, support teams, and managers, making the entire lending process faster and easier to track."
        ],
        "techstack": "React, Elixir"
      },
      {
        "position": "senior analyst - IT",
        "company": "mercadoLibre",
        "url": "https://www.mercadolibre.com",
        "date": "Aug 2021 - Abr 2022",
        "description": [
          "I built a secure chat and tracking tool for our fraud app so clients and employees could talk directly and check claim statuses in real-time. I also led the move of an old web app to a much better platform, where I set up new coding standards and added automated frontend testing to stop bugs from reaching users. Additionally, I worked on the core fraud features, specifically creating the logic to double-check and handle bank payments that were rejected."
        ],
        "techstack": "React, Go"
      },
      {
        "position": "fullstack developer",
        "company": "encora (AndGo Goodyear)",
        "url": "https://www.encora.com/",
        "date": "Abr 2022 - March 2024",
        "description": [
          "Engineered a specialized web platform for Goodyear automotive support, centralizing appointment logistics and technician dispatching. Orchestrated a custom workflow for workshop management that synchronized mechanic availability with real-time service demands. Developed a recurring maintenance module for high-priority diagnostics (e.g., engine performance), which optimized bay utilization and increased customer retention."
        ],
        "techstack": "React, Graphql, Cypress, Python"
      },
      {
        "position": "Software Engineer",
        "company": "Addi",
        "url": "https://co.addi.com/",
        "date": "Jul 2024 - current employeer",
        "description": [
          "I build and maintain high-traffic web and mobile apps (React and React Native) for an e-commerce platform with over 3 million users. My work focuses on making the shopping experience smooth and fast at scale. I use tools like Amplitude and LogRocket to track how users interact with the app, using that data to fix pain points and improve the UI with the design team. I also work on the backend using NestJS to build better middleware, making sure our internal services communicate clearly and stay reliable during peak traffic."
        ],
        "techstack": "React, Graphql, Cypress, Python"
      }
    ],
    "skills": [
      {
        "text": "complete",
        "experience": "4+ years of experience",
        "list": "HTML, CSS, Javascript, React"
      },
      {
        "text": "extensive",
        "experience": "3+ years of experience",
        "list": "Typescript, Unit Testing, Graphql, E2E Testing (Cypress), React Native, NestJS"
      },
      {
        "text": "solid",
        "experience": "2+ years of experience",
        "list": "Django, Python, Redux, Angular, Redux Toolkit, Golang"
      },
      {
        "text": "explorative",
        "experience": "1+ years of experience",
        "list": "Remix, NextJS, AWS S3, AWS EC2, Claude Dev, Windsurf"
      }
    ],
    "education": [
      {
        "title": "Bachelor's Degree in Systems Engineering (2017)",
        "institute": "Universidad Distrital Francisco José de Caldas"
      }
    ],
    "languages": [
      {
        "language": "spanish",
        "label": "native"
      },
      {
        "language": "english",
        "label": "professional"
      }
    ]
  }
}
